In [2]:
# DataBase
# Data를 저장하는 물리적인 공간
# 데이터를 저장,관리
# 대량의 데이터를 효율적으로 저장하고 검색하는데 사용

import sqlite3
# SQL(Structured Query Language) : 구조화된 질의 언어
# Row, Column을 통해 데이터 접근 가능
# DB에 접속,질의

# 1. DB 연결
# 2. SQL을 전달하는 통로 생성
# 3. SQL 전달
# 4. 통로 닫기

In [3]:
import sqlite3
# 1. DB 연결 : 접속하고싶은 db를 sqlite3.connect(DB명)
conn = sqlite3.connect("user.db") 
conn

# 2. SQL 통로 생성
curs = conn.cursor()
curs

# 3. SQL 전달

# 4. 통로 닫기 (역순으로 닫기)
curs.close()
conn.close()

In [4]:
# 1. DB연결
conn = sqlite3.connect("user.db")
# 2. SQL 통로 생성
curs = conn.cursor()
# 3.SQL 전달
# CRUD (Create Read Update Delete)
sql ="""
Create TABLE member(
    name TEXT,
    age INTEGER,
    MBTI TEXT
)
"""
# CUD의 행위로 해당 정보 반영
conn.commit()

# 4. 통로 닫기
curs.close()
conn.close()

In [ ]:
# A. departments 테이블의 모든 컬럼을 조회
# B. locations 테이블의 city 컬럼 조회

In [8]:
conn = sqlite3.connect("exam.db")
# 2. SQL 통로 생성
curs = conn.cursor()
# 3. SQL 전달
sql = """
SELECT *
FROM departments
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

   department_id   department_name  manager_id  location_id
0             10    Administration         101         1700
1             20         Marketing         102         1800
2             30        Purchasing         103         1900
3             40   Human Resources         104         2000
4             50          Shipping         105         2100
5             60                IT         106         2200
6             70  Public Relations         107         2300
7             80             Sales         108         2400
8             90         Executive         109         2500
9            100           Finance         110         2600

In [ ]:
conn = sqlite3.connect("exam.db")
# 2. SQL 통로 생성
curs = conn.cursor()
# 3. SQL 전달
sql = """
SELECT city
FROM locations
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
# 1. DB연결
conn = sqlite3.connect("exam.db")
# 2. SQL 통로 생성
curs = conn.cursor()
# 3. SQL 전달
sql = """
SELECT *
FROM employees
"""
# SELECT 문법
# SELECT 컬럼명1, 컬럼명2, *
# SELECT는 대소문자 구분 X, 하지만 대문자 default
curs.execute(sql)
# Python의 Pandas 라이브러리 안의 DataFrame을 다루면 좋을듯
import pandas as pd
# read_sql(sql문, conn 통로)
# conn 통로를 통해 sql문을 던지고 결과를 받아옴
df = pd.read_sql(sql,conn)
# result = curs.fetchall()
# for r in result:
#     print(r)
# 4. 통로 닫기
curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")

curs = conn.cursor()

# Alias 사용:
# 1. AS 뒤에 "이름"
# 2. AS 뒤에 이름
# 3. 그냥 띄어쓰기 + "이름"
sql = """
SELECT last_name, salary * 12 AS "연봉"
FROM employees
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

# 연결 연산자
# 컬럼의 결과를 연결하고자 할 때 사용
sql = """
SELECT last_name || first_name AS 한국식이름
FROM employees
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

#중복 행 제거
# DISTINCT(컬럼명)
sql = """
SELECT DISTINCT(department_id)
FROM employees
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

# WHERE
# 특정 조건에 부합하는 데이터만 가져오고 싶을 때
# 컬럼명 연산식
# SELECT -> FROM -> WHERE 순서
sql = """
SELECT last_name, salary
FROM employees
WHERE salary >= 10000
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, salary * 12 AS 연봉
FROM employees
WHERE salary * 12 >= 120000
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [49]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, department_id
FROM employees
WHERE employee_id = 176
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

  last_name  department_id
0    Porter             39

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()
# =, >=, >, <, <>, != (제외) : 단일 연산자
# IN(OR), BETWEEN 하한 AND 상한(범위 제한) : 복합 연산자
# 복합 연산자 부장 NOT 키워드
# NOT IN(175, 176, 177) -> 175,176,177 제외한 정보
sql = """
SELECT last_name, department_id
FROM employees
WHERE salary BETWEEN 7000 AND 8000
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT first_name, salary * 12 AS 연봉
FROM employees
WHERE salary * 12 NOT BETWEEN 150000 AND 200000
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [76]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()
# 복합 연산자 LIKE
# SQL에서 문자열은 ''으로 감싼다
# P% -> P로 시작 / %A -> A로 끝
# LIKE의 부정은 NOT LIKE
# _는 1자리를 의미

sql = """
SELECT last_name
FROM employees
WHERE last_name LIKE 'P_____'
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

  last_name
0    Pierce
1    Porter

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()
# 복합 연산자 NULL
# commission_pct 없는
# IS NULL의 부정은 IS NOT NULL
sql = """
SELECT last_name, commission_pct
FROM employees
WHERE commission_pct IS NOT NULL
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

# ORDER BY : 정렬
# 오름차순 : ASC / 내림차순 : DESC

sql = """
SELECT last_name, salary
FROM employees
ORDER BY salary ASC
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
# conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, hire_date
FROM employees
WHERE hire_date = '2016-05-17' 
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, employee_id, hire_date
FROM employees
WHERE hire_date BETWEEN '2020-01-01' AND '2025-07-11'
ORDER BY hire_date ASC
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [108]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, department_id
FROM employees
WHERE department_id = 20
OR department_id = 50
ORDER BY last_name ASC
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

  last_name  department_id
0     Hogan             50
1    Taylor             50
2  Thompson             50

In [117]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, salary * 12 AS '연봉'
FROM employees
WHERE department_id IN (20,50)
AND salary * 12 BETWEEN 200000 AND 2500000
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

Empty DataFrame
Columns: [last_name, 연봉]
Index: []

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, hire_date
FROM employees
WHERE hire_date LIKE '2020%'
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, job_id
FROM employees
WHERE manager_id IS NULL
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [1]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, job_id, manager_id
FROM employees
WHERE manager_id IS NOT NULL
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

NameError: name 'sqlite3' is not defined

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name
FROM employees
WHERE last_name LIKE '___a%'
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name
FROM employees
WHERE last_name LIKE '___a%'
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name
FROM employees
WHERE last_name LIKE '%a%'
AND last_name LIKE '%e%'
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT last_name, salary, job_id
FROM employees
WHERE salary NOT IN (2500, 3500, 7000)
AND job_id IN ('SA_REP','ST_CLERK')
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT DISTINCT(job_id)
FROM employees
WHERE department_id IN (30,90)
ORDER BY job_id ASC
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

# 그룹 함수
# AVG, COUNT, MAX, MIN, SUM
# 컬럼의 데이터들을 그룹화 하겠다
# GROUP BY 컬럼명


sql = """
SELECT job_id, COUNT(job_id), AVG(salary), SUM(salary), MAX(salary), MIN(salary)
FROM employees
GROUP BY job_id
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
# 4.JOIN
# employees, departments, locations Table 존재
# 정규화(Normalization) : 테이블을 정리하는 작업
# 여러 테이블로부터 데이터를 가져와서 합치는 작업 : Join
import pandas as pd

conn = sqlite3.connect("exam.db")
curs = conn.cursor()

# 성씨, 부서 ID, 부서명
sql = """
SELECT e.last_name, e.department_id, d.department_name
FROM employees e, departments d
WHERE e.department_id = d.department_id
"""


df = pd.read_sql(sql,conn)
curs.close()
conn.close()

df

In [ ]:
import pandas as pd

conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT d.department_name, l.location_id, l.city
FROM departments d, locations l
WHERE d.location_id = l.location_id
"""

df = pd.read_sql(sql,conn)
curs.close()
conn.close()

df

In [ ]:
import pandas as pd

conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT e.employee_id, e.last_name, d.department_id, d.department_name
FROM employees e, departments d
WHERE e.department_id = d.department_id
"""

df = pd.read_sql(sql,conn)
curs.close()
conn.close()

df

In [ ]:
import pandas as pd

conn = sqlite3.connect("exam.db")
curs = conn.cursor()

# 조인 조건이 잘못되면 모든 행 개수만큼 곱해져서 결과가 출력
# -> 카타시안 
sql = """
SELECT e.last_name, d.department_name, d.location_id, city
FROM employees e, departments d, locations l
WHERE e.commission_pct IS NULL
AND e.department_id = d.department_id
AND d.location_id = l.location_id
"""

df = pd.read_sql(sql,conn)
curs.close()
conn.close()

df

In [ ]:
import pandas as pd

conn = sqlite3.connect("exam.db")
curs = conn.cursor()
# Self
# 17.자신의 매니저보다 먼저 고용된 사원들의 성씨 및 고용일 출력
sql = """
SELECT e.last_name, e.hire_date
FROM employees e, employees m
WHERE e.manager_id = m.employee_id
AND e.hire_date < m.hire_date
"""

df = pd.read_sql(sql,conn)
curs.close()
conn.close()

df

In [215]:
# 그룹 함수 MAX, MIN, SUM, AVG

conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT MAX(salary), MIN(salary), SUM(salary), AVG(salary)
FROM employees
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

   MAX(salary)  MIN(salary)  SUM(salary)  AVG(salary)
0      14854.0       3030.0    1636113.0  9140.296089

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT job_id, MAX(salary), MIN(salary), SUM(salary), AVG(salary)
FROM employees
GROUP BY job_id
ORDER BY job_id ASC
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [230]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT DISTINCT(job_id), COUNT(job_id)
FROM employees
GROUP BY job_id
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

       job_id  COUNT(job_id)
0  AC_ACCOUNT             14
1      FI_MGR             21
2      HR_MAN             20
3      HR_REP             22
4     IT_PROG             12
5      MK_MAN             16
6      MK_REP             16
7    PU_CLERK             22
8      SA_MAN             18
9      SA_REP             18

In [239]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT COUNT(DISTINCT(manager_id)) AS '매니저의 총 수'
FROM employees
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

   매니저의 총 수
0        21

In [226]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT MAX(salary), MIN(salary),  MAX(salary) - MIN(salary) AS 'gap'
FROM employees
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

   MAX(salary)  MIN(salary)      gap
0      14854.0       3030.0  11824.0

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()
# HAVING 절
# WHERE -> 단일 행에만 적용
# 그룹화된 결과를 연산하기 위해 HAVING이 필요
sql = """
SELECT department_id, AVG(salary)
FROM employees
GROUP BY department_id
HAVING AVG(salary) >= 10000
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [242]:
# SELECT -> 조회할 column 명 명시
# FROM -> column이 있는 테이블
# WHERE -> 특정 조건에 맞는 데이터만 출력
# GROUP BY -> 그룹화
# HAVING -> 그룹화된 결과를 연산
# ORDER BY -> 정렬

In [264]:
# 23. 매니저의 사번 및 그 매니저 밑 사원들 중 최소 급여를 받는 사원의 급여를 출력하시오 - 매니저가 없는 사람들은 제외한다.
# - 최소 급여가 5000 미만인 경우는 제외한다.
# - 급여 기준 역순으로 조회한다.

conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT manager_id, MIN(salary)
FROM employees
WHERE manager_id IS NOT NULL
GROUP BY manager_id
HAVING MIN(salary) >= 5000
ORDER BY MIN(salary) DESC
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

   manager_id  MIN(salary)
0         107      13752.0
1         114       6524.0
2         116       5762.0
3         117       5731.0
4         106       5631.0
5         109       5264.0

In [270]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT d.department_name, d.location_id, COUNT(e.employee_id), AVG(e.salary)
FROM departments d, employees e
WHERE d.department_id = e.department_id
GROUP BY d.department_name, d.location_id
ORDER BY d.location_id ASC
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

    department_name  location_id  COUNT(e.employee_id)  AVG(e.salary)
0    Administration         1700                     2   10214.000000
1        Purchasing         1900                     1   13113.000000
2          Shipping         2100                     3    7908.000000
3                IT         2200                     3    5316.000000
4  Public Relations         2300                     3    9943.333333
5             Sales         2400                     1    4345.000000
6         Executive         2500                     1    3152.000000
7           Finance         2600                     1   13437.000000

In [275]:
# Sub Query

conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT employee_id, hire_date
FROM employees
WHERE department_id = (SELECT department_id 
                       FROM employees
                       WHERE last_name = 'Ryan')
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

   employee_id   hire_date
0           19  2024-01-04
1           21  2020-10-28
2          154  2022-01-04
3          172  2020-07-25
4          178  2016-05-06

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT employee_id, last_name
FROM employees
WHERE salary > (SELECT AVG(salary) 
                FROM employees)
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT employee_id, last_name
FROM employees
WHERE department_id IN (SELECT department_id
                       FROM employees
                       WHERE last_name LIKE '%u%')
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [284]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT e.last_name, d.department_name, l.location_id
FROM employees e, departments d, locations l
WHERE e.department_id = d.department_id
AND d.location_id = l.location_id
AND l.city = 'Seattle'
AND e.commission_pct IS NULL
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

  last_name department_name  location_id
0     Smith  Administration         1700
1    Harris  Administration         1700

In [261]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT *
FROM departments
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

   department_id   department_name  manager_id  location_id
0             10    Administration         101         1700
1             20         Marketing         102         1800
2             30        Purchasing         103         1900
3             40   Human Resources         104         2000
4             50          Shipping         105         2100
5             60                IT         106         2200
6             70  Public Relations         107         2300
7             80             Sales         108         2400
8             90         Executive         109         2500
9            100           Finance         110         2600

In [ ]:
conn = sqlite3.connect("exam.db")
curs = conn.cursor()

sql = """
SELECT *
FROM employees
"""

import pandas as pd
df = pd.read_sql(sql,conn)

curs.close()
conn.close()

df

In [6]:
# DataBase
# 자료 저장하는 방법
# SQL(Structured Query Language)

# 1. DB연결
# 2. sqlite3(DBMS) : python에서 물리적으로 .db파일을 통해 데이터베이스 사용
# exam.db를 줌으로서 안에 테이블 공유
import sqlite3
conn = sqlite3.connect("exam.db")
# 2. SQL 통로 생성
curs = conn.cursor()
# 3. SQL 전달
sql = """
SELECT *
FROM employees
WHERE employee_id = 176
"""
curs.execute(sql)
result = curs.fetchall()
print(result)
# 4. 통로 닫기
curs.close()
conn.close()

[(176, 'Alexandra', 'Porter', 'alexandra.porter@example.com', '495.262.1888', '2016-05-17', 'HR_REP', 14105.0, None, 102, 39)]

In [ ]:
# CRUD
# R (Read) :SELECT

In [9]:
# exam.db를 test.db로 복사해서 연습
# 파일, 폴더 등 관련 라이브러리
# os, shutil
import shutil
shutil.copy("exam.db, "test.db)

'test.db'

In [15]:
# C
# table 생성
# CREATE 테이블명(컬럼명1 데이터타입, 컬럼명2 데이터타입)
import sqlite3
conn = sqlite3.connect("test.db")
curs = conn.cursor()

sql = """
CREATE TABLE today(
    time DATETIME,
    temp NUMBER
)
"""

curs.execute(sql)

curs.close()
conn.close()

In [30]:
# C
# data 삽입
conn = sqlite3.connect("test.db")
curs = conn.cursor()
# insert into 테이블명
# values (컬럼명1데이터, 컬럼명2데이터, ...)
sql = """
insert into today
values(datetime('now'),26.6)
"""

curs.execute(sql)
conn.commit()

curs.close()
conn.close()

In [33]:
conn = sqlite3.connect("test.db")
curs = conn.cursor()

sql = """
SELECT *
FROM today
"""

curs.execute(sql)
result = curs.fetchall()
print(result)
curs.close()
conn.close()

[('2025-07-14 00:35:00', 79.16), ('2025-07-14 00:40:28', 79.16), ('2025-07-14 00:45:28', 79.16), ('2025-07-14 00:45:36', 26.6)]

In [ ]:
# DB
# 트랜잭션 (Transaction)
# 우리가 test.db에 혼자 접속해서 작업
# 작업단위
# 이전 사람의 작업이 완료가 되면 그 다음 작업이 반영

# insert into 데이터 삽입
# C, U, D의 작업이 끝나면 반드시 둘 중 하나를 진행(commt, rollback)
# commit : 내 작업을 반영
# rollback : 이전 상태로 되돌리기

In [32]:
conn = sqlite3.connect("test.db")
curs = conn.cursor()

sql = """
UPDATE today
SET temp = 79.16
WHERE temp = 26.2
"""

curs.execute(sql)
conn.commit()

curs.close()
conn.close()

In [58]:
# API (Application Programming Interface)
# Interface : 프로그램의 설계, 약속, 명세
API_KEY_W = "58148fc10404e658ebcebf78cf9f9f65"
city_name = "seoul"
url_current_weather = f"https://api.openweathermap.org/data/2.5/weather?q={city_name}&appid={API_KEY_W}"
url_current_weather += "&units=metric"

In [123]:
import requests # 요청관련라이브러리
response = requests.get(url_current_weather)

In [125]:
# 응답을 처리하는 3가지 방법
# response.text -> html문서, 문자열
# response.content -> byte, file, image
# response.json -> dictionary
result = response.json()
main = result["main"]
wind = result["wind"]
weather_list = result["weather"]

weather = weather_list[0]["main"]
temp = main["temp"]
temp_min = main["temp_min"]
temp_max = main["temp_max"]
feels_like = main["feels_like"]
humidity = main["humidity"]
speed = wind["speed"]

print()
print(f"기상상태 : {weather}")
print(f"현재기온 : {temp}")
print(f"최저기온 : {temp_min}")
print(f"최고기온 : {temp_max}")
print(f"체감온도 : {feels_like}")
print(f"습도 : {humidity}%")
print(f"풍속 : {speed}m/s")

기상상태 : Rain
현재기온 : 26.53
최저기온 : 26.53
최고기온 : 26.53
체감온도 : 26.53
습도 : 71%
풍속 : 0.58m/s

In [136]:
# forecast
city_name_forecast = "seoul"
url_forecast_weather = f"https://api.openweathermap.org/data/2.5/forecast?q={city_name_forecast}&appid={API_KEY_W}"
url_forecast_weather += "&units=metric"

In [ ]:
response_forecast = requests.get(url_forecast_weather)
result_forecast = response_forecast.json()
result_forecast

In [159]:
forecast_list = result_forecast["list"]


def time_convert(s):
    return s.split(" ")[0][5:7] + "/" + s.split(" ")[0][-2:] + " " + s.split(" ")[1][:2] +"H"

forecast_list[39]

{'dt': 1752883200,
 'main': {'temp': 25.8,
  'feels_like': 26.6,
  'temp_min': 25.8,
  'temp_max': 25.8,
  'pressure': 1005,
  'sea_level': 1005,
  'grnd_level': 996,
  'humidity': 83,
  'temp_kf': 0},
 'weather': [{'id': 500,
   'main': 'Rain',
   'description': 'light rain',
   'icon': '10d'}],
 'clouds': {'all': 69},
 'wind': {'speed': 2.23, 'deg': 175, 'gust': 3.98},
 'visibility': 10000,
 'pop': 0.27,
 'rain': {'3h': 0.36},
 'sys': {'pod': 'd'},
 'dt_txt': '2025-07-19 00:00:00'}

In [160]:
temp_list = []
rain_list = []
weather_list = []
time_list = []

for i in range(40):
    temp_list.append(forecast_list[i]["main"]["temp"])
    try:
        rain_list.append(forecast_list[i]["rain"]["3h"])
    except KeyError:
        rain_list.append(0)
        
    weather_list.append(forecast_list[i]["weather"][0]["main"])
    time_list.append(time_convert(forecast_list[i]["dt_txt"]))

In [ ]:
weather_list